; domain
(define (domain industrial_manufacturing)
    (:requirements :strips :typing)
    (:types
        location box content agent workstation content-type carrier place - object
    )

    (:predicates
        (connected ?loc1 ?loc2 - location)
        (box-at-loc ?box - box ?loc - location)
        (agent-at-loc ?agent - agent ?loc - location)
        (ws-at-loc ?ws - workstation ?loc - location)
        (content-at-loc ?content - content ?loc - location)
        (is-type ?content - content ?t - content-type)
        (empty-box ?box - box)
        (filled-box ?box - box ?content - content)
        (box-at-ws ?box - box ?ws - workstation)
        (box-at-place ?box - box ?place - place)
        (content-type-at-ws ?t - content-type ?ws - workstation)
        (empty-place ?place - place)
        (place-at-carrier ?place - place ?carrier - carrier)
        (carrier-at-agent ?carrier - carrier ?agent - agent)
    )

    (:action pick-up
        :parameters (?loc - location ?box - box ?agent - agent ?carrier - carrier ?place - place)
        :precondition (and
            (agent-at-loc ?agent ?loc)
            (box-at-loc ?box ?loc)
            (carrier-at-agent ?carrier ?agent)
            (place-at-carrier ?place ?carrier)
            (empty-place ?place)
        )
        :effect (and
            (box-at-place ?box ?place)
            (not (empty-place ?place))
            (not (box-at-loc ?box ?loc))
        )
    )

    (:action move
        :parameters (?from ?to - location ?agent - agent)
        :precondition (and
            (connected ?from ?to)
            (agent-at-loc ?agent ?from)
        )
        :effect (and
            (not (agent-at-loc ?agent ?from))
            (agent-at-loc ?agent ?to)
        )
    )

    (:action deliver
        :parameters (?box - box ?content - content ?t - content-type ?ws - workstation ?location - location ?agent - agent ?carrier - carrier ?place - place)
        :precondition (and
            (is-type ?content ?t)
            (ws-at-loc ?ws ?location)
            (agent-at-loc ?agent ?location)
            (carrier-at-agent ?carrier ?agent)
            (place-at-carrier ?place ?carrier)
            (box-at-place ?box ?place)
            (filled-box ?box ?content)
        )
        :effect (and
            (not (box-at-place ?box ?place))
            (empty-place ?place)
            (box-at-ws ?box ?ws)
        )
    )

    (:action fill
        :parameters (?box - box ?content - content ?t - content-type ?loc - location ?agent - agent ?carrier - carrier ?place - place)
        :precondition (and
            (is-type ?content ?t)
            (content-at-loc ?content ?loc)
            (agent-at-loc ?agent ?loc)
            (carrier-at-agent ?carrier ?agent)
            (place-at-carrier ?place ?carrier)
            (box-at-place ?box ?place)
            (empty-box ?box)
        )
        :effect (and
            (not (empty-box ?box))
            (filled-box ?box ?content)
            (not (content-at-loc ?content ?loc))
        )
    )

    (:action empty
        :parameters (?box - box ?content - content ?t - content-type ?ws - workstation ?agent - agent ?loc - location)
        :precondition (and
            (is-type ?content ?t)
            (box-at-ws ?box ?ws)
            (ws-at-loc ?ws ?loc)
            (filled-box ?box ?content)
            (agent-at-loc ?agent ?loc)
        )
        :effect (and
            (not (filled-box ?box ?content))
            (empty-box ?box)
            (box-at-loc ?box ?loc)
            (not (box-at-ws ?box ?ws))
            (content-type-at-ws ?t ?ws)
        )
    )
)

; problem
(define (problem p02)
    (:domain industrial_manufacturing)
    (:objects
        central_warehouse loc1 - location
        ws1 ws2 ws3 - workstation
        b1 b2 - box
        a1 - agent
        c1 - carrier
        p1 p2 - place
        valve1 valve2 valve3 bolt1 tool1 - content
        valve bolt tool - content-type
    )
    (:init
        (connected central_warehouse loc1)
        (connected loc1 central_warehouse)
        
        (is-type valve1 valve)
        (is-type valve2 valve)
        (is-type valve3 valve)
        (is-type bolt1 bolt)
        (is-type tool1 tool)

        (box-at-loc b1 central_warehouse)
        (box-at-loc b2 central_warehouse)
        (empty-box b1)
        (empty-box b2)

        (content-at-loc valve1 central_warehouse)
        (content-at-loc valve2 central_warehouse)
        (content-at-loc valve3 central_warehouse)
        (content-at-loc bolt1 central_warehouse)
        (content-at-loc tool1 central_warehouse)

        (ws-at-loc ws1 loc1)
        (ws-at-loc ws2 loc1)
        (ws-at-loc ws3 loc1)

        (agent-at-loc a1 central_warehouse)
        (carrier-at-agent c1 a1)
        (place-at-carrier p1 c1)
        (place-at-carrier p2 c1)
        (empty-place p1)
        (empty-place p2)
    )
    (:goal
        (and
            (content-type-at-ws bolt ws1)
            (content-type-at-ws valve ws1)
            (content-type-at-ws valve ws2)
            (content-type-at-ws tool ws3)
        )
    )
)

; plan
1. (pick-up central_warehouse b2 a1 c1 p1)
   deleted: (empty-place p1) (box-at-loc b2 central_warehouse)
   added: (box-at-place b2 p1)
   goals met: 0 of 4
2. (fill b2 bolt1 bolt central_warehouse a1 c1 p1)
   deleted: (empty-box b2) (content-at-loc bolt1 central_warehouse)
   added: (filled-box b2 bolt1)
   goals met: 0 of 4
3. (pick-up central_warehouse b1 a1 c1 p2)
   deleted: (empty-place p2) (box-at-loc b1 central_warehouse)
   added: (box-at-place b1 p2)
   goals met: 0 of 4
4. (fill b1 tool1 tool central_warehouse a1 c1 p2)
   deleted: (empty-box b1) (content-at-loc tool1 central_warehouse)
   added: (filled-box b1 tool1)
   goals met: 0 of 4
5. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 0 of 4
6. (deliver b1 tool1 tool ws3 loc1 a1 c1 p2)
   deleted: (box-at-place b1 p2)
   added: (empty-place p2) (box-at-ws b1 ws3)
   goals met: 0 of 4
7. (empty b1 tool1 tool ws3 a1 loc1)
   deleted: (filled-box b1 tool1) (box-at-ws b1 ws3)
   added: (empty-box b1) (box-at-loc b1 loc1) (content-type-at-ws tool ws3)
   goals met: 1 of 4
8. (deliver b2 bolt1 bolt ws1 loc1 a1 c1 p1)
   deleted: (box-at-place b2 p1)
   added: (empty-place p1) (box-at-ws b2 ws1)
   goals met: 1 of 4
9. (empty b2 bolt1 bolt ws1 a1 loc1)
   deleted: (filled-box b2 bolt1) (box-at-ws b2 ws1)
   added: (empty-box b2) (box-at-loc b2 loc1) (content-type-at-ws bolt ws1)
   goals met: 2 of 4
10. (pick-up loc1 b2 a1 c1 p1)
   deleted: (empty-place p1) (box-at-loc b2 loc1)
   added: (box-at-place b2 p1)
   goals met: 2 of 4
11. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 2 of 4
12. (fill b2 valve1 valve central_warehouse a1 c1 p1)
   deleted: (empty-box b2) (content-at-loc valve1 central_warehouse)
   added: (filled-box b2 valve1)
   goals met: 2 of 4
13. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 2 of 4
14. (deliver b2 valve1 valve ws1 loc1 a1 c1 p1)
   deleted: (box-at-place b2 p1)
   added: (empty-place p1) (box-at-ws b2 ws1)
   goals met: 2 of 4
15. (empty b2 valve1 valve ws1 a1 loc1)
   deleted: (filled-box b2 valve1) (box-at-ws b2 ws1)
   added: (empty-box b2) (box-at-loc b2 loc1) (content-type-at-ws valve ws1)
   goals met: 3 of 4
16. (pick-up loc1 b2 a1 c1 p1)
   deleted: (empty-place p1) (box-at-loc b2 loc1)
   added: (box-at-place b2 p1)
   goals met: 3 of 4
17. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 3 of 4
18. (fill b2 valve2 valve central_warehouse a1 c1 p1)
   deleted: (empty-box b2) (content-at-loc valve2 central_warehouse)
   added: (filled-box b2 valve2)
   goals met: 3 of 4
19. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 3 of 4
20. (deliver b2 valve2 valve ws2 loc1 a1 c1 p1)
   deleted: (box-at-place b2 p1)
   added: (empty-place p1) (box-at-ws b2 ws2)
   goals met: 3 of 4
21. (empty b2 valve2 valve ws2 a1 loc1)
   deleted: (filled-box b2 valve2) (box-at-ws b2 ws2)
   added: (empty-box b2) (box-at-loc b2 loc1) (content-type-at-ws valve ws2)
   goals met: 4 of 4
